n = input()                        # Зчитуємо п’ятизначне число як рядок
a = int(n[0])                      # Перша цифра
b = int(n[1])                      # Друга цифра
c = int(n[2])                      # Третя цифра
d = int(n[3])                      # Четверта цифра
e = int(n[4])                      # П’ята цифра
s1 = a + c + e                     # Сума 1, 3, 5 цифр
s2 = b + d                         # Сума 2 і 4 цифр
print(f"{s1}{s2}")                 # Виводимо обидві суми разом